dictionary = {
    "אופנה" : ["ביגוד, תכשיטים וקוסמטיקה"],
    "דלק, חשמל וגז" : ["חשבון חשמל", "חשבון גז", "חשבון תמי 4", "דלק לרכב"],
    "חיות מחמד" : ["הוצאות טיפול בחיית מחמד", "כלב"],
    "חשמל ומחשבים" : ["עסקי", "גאדג'טים ואלקטרוניקה"],
    "מזון וצריכה" : ["מצרכי מזון", "רהיטים, כלי בית וגן"],
    "מסעדות, קפה וברים" : ["אוכל בחוץ (כולל מסעדות, בתי קפה, משלוחים)", "פאבים ומועדוני לילה"],
    "עיצוב הבית" : ["תיקונים דחופים בבית (לא שיפוצים)", "שיפוץ ועיצוב הבית "],
    "עירייה וממשלה" : ["ארנונה (דו חודשית)", "חשבון מים וביוב", "עמלות שירות ובירוקרטיה", 'דו"חות וקנסות', "נשק"],
    "פנאי, בידור וספורט" : ["מנוי לשירותים אינטרנטיים", "תרבות וספורט"],
    "רפואה ובתי מרקחת" : ["תרופות, בדיקות וטיפולים רפואיים", "פארם"],
    "שונות" : ["מתנות", "דת", "מותרות משתנה אחרת"],
    "שירותי תקשורת" : ["תשתית אינטרנט", "סלולארי"],
    "תחבורה ורכבים" : ["הוצאות תחבורה ציבורית ואופניים", "טסט לרכב", "טיפולים לרכב", "כביש 6 וחוצה צפון", "חניה", "השכרת רכב"],
    "משיכת מזומן" : ["משיכת כספים (כספומט)"],
    "טיסות ותיירות" : ["חופשות בארץ", 'חופשות בחו"ל'],
    "ספרים ודפוס" : ["לימודים ומצרכי לימוד", "ספרים ומוזיקה"],
    "קוסמטיקה וטיפוח" : ["מוצרי היגיינה", "תספורת"],
    "ביטוח" : ["ביטוח רכב"]
}

dict1 = {"hello" : 0}
hello = [1, 2, 3, 4, 5]
for num in hello:
    dict1.update({"hello" : dict1["hello"] + num})
print(dict1)