# dict of main-categories to sub-categories
fullDict = {
        "אופנה" : ("ביגוד, תכשיטים וקוסמטיקה"),
        "דלק, חשמל וגז" : ("חשבון חשמל", "חשבון גז", "חשבון תמי 4"),
        "העברת כספים" : (""),
        "חיות מחמד" : ("הוצאות טיפול בחיית מחמד", "כלב"),
        "חשמל ומחשבים" : ("עסקי", "גאדג'טים ואלקטרוניקה"),
        "מזון וצריכה" : ("מצרכי מזון","רהיטים, כלי בית וגן"),
        "מסעדות, קפה וברים" : ("אוכל בחוץ (כולל מסעדות, בתי קפה, משלוחים)", "פאבים ומועדוני לילה"),
        "עיצוב הבית" : ("תיקונים דחופים בבית (לא שיפוצים)", "שיפוץ ועיצוב הבית "),
        "עירייה וממשלה" : ("ארנונה (דו חודשית)", "חשבון מים וביוב", "עמלות שירות ובירוקרטיה", 'דו"חות וקנסות', "נשק"),
        "פנאי, בידור וספורט" : ("מנוי לשירותים אינטרנטיים", "תרבות וספורט"),
        "רפואה ובתי מרקחת" : ("תרופות, בדיקות וטיפולים רפואיים", "פארם"),
        "שונות" : ("מתנות", "דת", "מותרות משתנה אחרת"),
        "שירותי תקשורת" : ("תשתית אינטרנט", "סלולארי"),
        "תחבורה ורכבים" : ("הוצאות תחבורה ציבורית ואופניים", "השכרת רכב", "טסט לרכב", "טיפולים לרכב", "כביש 6 וחוצה צפון", "חניה"),
        "משיכת מזומן" : ("משיכת כספים (כספומט)"),
        "טיסות ותיירות" : ("חופשות בארץ", 'חופשות בחו"ל'),
        "ספרים ודפוס" : ("לימודים ומצרכי לימוד", "ספרים ומוזיקה"),
        "קוסמטיקה וטיפוח" : ("מוצרי היגיינה", "תספורת"),
        "ביטוח" : ("ביטוח רכב")
    }

# dict for the expense column by the month
monthToExpenseColDict = {
    1 : "C",
    2 : "D",
    3 : "E",
    4 : "F",
    5 : "G",
    6 : "H",
    7 : "I",
    8 : "J",
    9 : "K",
    10 : "L",
    11 : "M",
    12 : "N",
}